; domain
(define (domain grid-visitAll)
(:requirements :strips :typing :negative-preconditions)
(:types
place - object
)
(:predicates
	(at-robot ?x1 - place)
	(visited ?x1 - place)
	(connected ?x1 - place ?x2 - place)
)
(:action move
	:parameters (?x1 - place ?x2 - place )
	:precondition (and
	(not(at-robot ?x2))
	(at-robot ?x1)
	(connected ?x1 ?x2))
	:effect (and
	(at-robot ?x2)
	(not(at-robot ?x1)))
)
(:action visit
	:parameters (?x1 - place )
	:precondition (and
	(at-robot ?x1)
	(not(visited ?x1)))
	:effect (and
	(visited ?x1))
)
)

; problem
(define (problem grid-5)
(:domain grid-visitAll)
(:objects
	loc-x0-y0
	loc-x0-y1
	loc-x0-y2
	loc-x0-y3
	loc-x0-y4
	loc-x1-y0
	loc-x1-y1
	loc-x1-y2
	loc-x1-y3
	loc-x1-y4
	loc-x2-y0
	loc-x2-y1
	loc-x2-y2
	loc-x2-y3
	loc-x2-y4
	loc-x3-y0
	loc-x3-y1
	loc-x3-y2
	loc-x3-y3
	loc-x3-y4
	loc-x4-y0
	loc-x4-y1
	loc-x4-y2
	loc-x4-y3
	loc-x4-y4
- place

)
(:init
	(at-robot loc-x2-y2)
	(visited loc-x2-y2)
	(connected loc-x0-y0 loc-x1-y0)
 	(connected loc-x0-y0 loc-x0-y1)
 	(connected loc-x0-y1 loc-x1-y1)
 	(connected loc-x0-y1 loc-x0-y0)
 	(connected loc-x0-y1 loc-x0-y2)
 	(connected loc-x0-y2 loc-x1-y2)
 	(connected loc-x0-y2 loc-x0-y1)
 	(connected loc-x0-y2 loc-x0-y3)
 	(connected loc-x0-y3 loc-x1-y3)
 	(connected loc-x0-y3 loc-x0-y2)
 	(connected loc-x0-y3 loc-x0-y4)
 	(connected loc-x0-y4 loc-x1-y4)
 	(connected loc-x0-y4 loc-x0-y3)
 	(connected loc-x1-y0 loc-x0-y0)
 	(connected loc-x1-y0 loc-x2-y0)
 	(connected loc-x1-y0 loc-x1-y1)
 	(connected loc-x1-y1 loc-x0-y1)
 	(connected loc-x1-y1 loc-x2-y1)
 	(connected loc-x1-y1 loc-x1-y0)
 	(connected loc-x1-y1 loc-x1-y2)
 	(connected loc-x1-y2 loc-x0-y2)
 	(connected loc-x1-y2 loc-x2-y2)
 	(connected loc-x1-y2 loc-x1-y1)
 	(connected loc-x1-y2 loc-x1-y3)
 	(connected loc-x1-y3 loc-x0-y3)
 	(connected loc-x1-y3 loc-x2-y3)
 	(connected loc-x1-y3 loc-x1-y2)
 	(connected loc-x1-y3 loc-x1-y4)
 	(connected loc-x1-y4 loc-x0-y4)
 	(connected loc-x1-y4 loc-x2-y4)
 	(connected loc-x1-y4 loc-x1-y3)
 	(connected loc-x2-y0 loc-x1-y0)
 	(connected loc-x2-y0 loc-x3-y0)
 	(connected loc-x2-y0 loc-x2-y1)
 	(connected loc-x2-y1 loc-x1-y1)
 	(connected loc-x2-y1 loc-x3-y1)
 	(connected loc-x2-y1 loc-x2-y0)
 	(connected loc-x2-y1 loc-x2-y2)
 	(connected loc-x2-y2 loc-x1-y2)
 	(connected loc-x2-y2 loc-x3-y2)
 	(connected loc-x2-y2 loc-x2-y1)
 	(connected loc-x2-y2 loc-x2-y3)
 	(connected loc-x2-y3 loc-x1-y3)
 	(connected loc-x2-y3 loc-x3-y3)
 	(connected loc-x2-y3 loc-x2-y2)
 	(connected loc-x2-y3 loc-x2-y4)
 	(connected loc-x2-y4 loc-x1-y4)
 	(connected loc-x2-y4 loc-x3-y4)
 	(connected loc-x2-y4 loc-x2-y3)
 	(connected loc-x3-y0 loc-x2-y0)
 	(connected loc-x3-y0 loc-x4-y0)
 	(connected loc-x3-y0 loc-x3-y1)
 	(connected loc-x3-y1 loc-x2-y1)
 	(connected loc-x3-y1 loc-x4-y1)
 	(connected loc-x3-y1 loc-x3-y0)
 	(connected loc-x3-y1 loc-x3-y2)
 	(connected loc-x3-y2 loc-x2-y2)
 	(connected loc-x3-y2 loc-x4-y2)
 	(connected loc-x3-y2 loc-x3-y1)
 	(connected loc-x3-y2 loc-x3-y3)
 	(connected loc-x3-y3 loc-x2-y3)
 	(connected loc-x3-y3 loc-x4-y3)
 	(connected loc-x3-y3 loc-x3-y2)
 	(connected loc-x3-y3 loc-x3-y4)
 	(connected loc-x3-y4 loc-x2-y4)
 	(connected loc-x3-y4 loc-x4-y4)
 	(connected loc-x3-y4 loc-x3-y3)
 	(connected loc-x4-y0 loc-x3-y0)
 	(connected loc-x4-y0 loc-x4-y1)
 	(connected loc-x4-y1 loc-x3-y1)
 	(connected loc-x4-y1 loc-x4-y0)
 	(connected loc-x4-y1 loc-x4-y2)
 	(connected loc-x4-y2 loc-x3-y2)
 	(connected loc-x4-y2 loc-x4-y1)
 	(connected loc-x4-y2 loc-x4-y3)
 	(connected loc-x4-y3 loc-x3-y3)
 	(connected loc-x4-y3 loc-x4-y2)
 	(connected loc-x4-y3 loc-x4-y4)
 	(connected loc-x4-y4 loc-x3-y4)
 	(connected loc-x4-y4 loc-x4-y3)

)
(:goal
(and
	(visited loc-x0-y0)
	(visited loc-x0-y1)
	(visited loc-x0-y2)
	(visited loc-x0-y3)
	(visited loc-x0-y4)
	(visited loc-x1-y0)
	(visited loc-x1-y1)
	(visited loc-x1-y2)
	(visited loc-x1-y3)
	(visited loc-x1-y4)
	(visited loc-x2-y0)
	(visited loc-x2-y1)
	(visited loc-x2-y2)
	(visited loc-x2-y3)
	(visited loc-x2-y4)
	(visited loc-x3-y0)
	(visited loc-x3-y1)
	(visited loc-x3-y2)
	(visited loc-x3-y3)
	(visited loc-x3-y4)
	(visited loc-x4-y0)
	(visited loc-x4-y1)
	(visited loc-x4-y2)
	(visited loc-x4-y3)
	(visited loc-x4-y4)
)
)
)

; plan
1. (move loc-x2-y2 loc-x1-y2)
   deleted: (at-robot loc-x2-y2)
   added: (at-robot loc-x1-y2)
   goals met: 1 of 25
2. (move loc-x1-y2 loc-x1-y1)
   deleted: (at-robot loc-x1-y2)
   added: (at-robot loc-x1-y1)
   goals met: 1 of 25
3. (visit loc-x1-y1)
   added: (visited loc-x1-y1)
   goals met: 2 of 25
4. (move loc-x1-y1 loc-x0-y1)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x0-y1)
   goals met: 2 of 25
5. (move loc-x0-y1 loc-x0-y0)
   deleted: (at-robot loc-x0-y1)
   added: (at-robot loc-x0-y0)
   goals met: 2 of 25
6. (visit loc-x0-y0)
   added: (visited loc-x0-y0)
   goals met: 3 of 25
7. (move loc-x0-y0 loc-x0-y1)
   deleted: (at-robot loc-x0-y0)
   added: (at-robot loc-x0-y1)
   goals met: 3 of 25
8. (visit loc-x0-y1)
   added: (visited loc-x0-y1)
   goals met: 4 of 25
9. (move loc-x0-y1 loc-x1-y1)
   deleted: (at-robot loc-x0-y1)
   added: (at-robot loc-x1-y1)
   goals met: 4 of 25
10. (move loc-x1-y1 loc-x1-y0)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x1-y0)
   goals met: 4 of 25
11. (move loc-x1-y0 loc-x2-y0)
   deleted: (at-robot loc-x1-y0)
   added: (at-robot loc-x2-y0)
   goals met: 4 of 25
12. (visit loc-x2-y0)
   added: (visited loc-x2-y0)
   goals met: 5 of 25
13. (move loc-x2-y0 loc-x1-y0)
   deleted: (at-robot loc-x2-y0)
   added: (at-robot loc-x1-y0)
   goals met: 5 of 25
14. (move loc-x1-y0 loc-x1-y1)
   deleted: (at-robot loc-x1-y0)
   added: (at-robot loc-x1-y1)
   goals met: 5 of 25
15. (move loc-x1-y1 loc-x1-y2)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x1-y2)
   goals met: 5 of 25
16. (visit loc-x1-y2)
   added: (visited loc-x1-y2)
   goals met: 6 of 25
17. (move loc-x1-y2 loc-x1-y3)
   deleted: (at-robot loc-x1-y2)
   added: (at-robot loc-x1-y3)
   goals met: 6 of 25
18. (move loc-x1-y3 loc-x2-y3)
   deleted: (at-robot loc-x1-y3)
   added: (at-robot loc-x2-y3)
   goals met: 6 of 25
19. (visit loc-x2-y3)
   added: (visited loc-x2-y3)
   goals met: 7 of 25
20. (move loc-x2-y3 loc-x3-y3)
   deleted: (at-robot loc-x2-y3)
   added: (at-robot loc-x3-y3)
   goals met: 7 of 25
21. (move loc-x3-y3 loc-x3-y4)
   deleted: (at-robot loc-x3-y3)
   added: (at-robot loc-x3-y4)
   goals met: 7 of 25
22. (visit loc-x3-y4)
   added: (visited loc-x3-y4)
   goals met: 8 of 25
23. (move loc-x3-y4 loc-x3-y3)
   deleted: (at-robot loc-x3-y4)
   added: (at-robot loc-x3-y3)
   goals met: 8 of 25
24. (move loc-x3-y3 loc-x4-y3)
   deleted: (at-robot loc-x3-y3)
   added: (at-robot loc-x4-y3)
   goals met: 8 of 25
25. (visit loc-x4-y3)
   added: (visited loc-x4-y3)
   goals met: 9 of 25
26. (move loc-x4-y3 loc-x3-y3)
   deleted: (at-robot loc-x4-y3)
   added: (at-robot loc-x3-y3)
   goals met: 9 of 25
27. (move loc-x3-y3 loc-x3-y2)
   deleted: (at-robot loc-x3-y3)
   added: (at-robot loc-x3-y2)
   goals met: 9 of 25
28. (visit loc-x3-y2)
   added: (visited loc-x3-y2)
   goals met: 10 of 25
29. (move loc-x3-y2 loc-x3-y1)
   deleted: (at-robot loc-x3-y2)
   added: (at-robot loc-x3-y1)
   goals met: 10 of 25
30. (visit loc-x3-y1)
   added: (visited loc-x3-y1)
   goals met: 11 of 25
31. (move loc-x3-y1 loc-x2-y1)
   deleted: (at-robot loc-x3-y1)
   added: (at-robot loc-x2-y1)
   goals met: 11 of 25
32. (visit loc-x2-y1)
   added: (visited loc-x2-y1)
   goals met: 12 of 25
33. (move loc-x2-y1 loc-x1-y1)
   deleted: (at-robot loc-x2-y1)
   added: (at-robot loc-x1-y1)
   goals met: 12 of 25
34. (move loc-x1-y1 loc-x1-y0)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x1-y0)
   goals met: 12 of 25
35. (visit loc-x1-y0)
   added: (visited loc-x1-y0)
   goals met: 13 of 25
36. (move loc-x1-y0 loc-x1-y1)
   deleted: (at-robot loc-x1-y0)
   added: (at-robot loc-x1-y1)
   goals met: 13 of 25
37. (move loc-x1-y1 loc-x1-y2)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x1-y2)
   goals met: 13 of 25
38. (move loc-x1-y2 loc-x0-y2)
   deleted: (at-robot loc-x1-y2)
   added: (at-robot loc-x0-y2)
   goals met: 13 of 25
39. (move loc-x0-y2 loc-x0-y3)
   deleted: (at-robot loc-x0-y2)
   added: (at-robot loc-x0-y3)
   goals met: 13 of 25
40. (visit loc-x0-y3)
   added: (visited loc-x0-y3)
   goals met: 14 of 25
41. (move loc-x0-y3 loc-x0-y2)
   deleted: (at-robot loc-x0-y3)
   added: (at-robot loc-x0-y2)
   goals met: 14 of 25
42. (move loc-x0-y2 loc-x1-y2)
   deleted: (at-robot loc-x0-y2)
   added: (at-robot loc-x1-y2)
   goals met: 14 of 25
43. (move loc-x1-y2 loc-x2-y2)
   deleted: (at-robot loc-x1-y2)
   added: (at-robot loc-x2-y2)
   goals met: 14 of 25
44. (move loc-x2-y2 loc-x2-y3)
   deleted: (at-robot loc-x2-y2)
   added: (at-robot loc-x2-y3)
   goals met: 14 of 25
45. (move loc-x2-y3 loc-x3-y3)
   deleted: (at-robot loc-x2-y3)
   added: (at-robot loc-x3-y3)
   goals met: 14 of 25
46. (move loc-x3-y3 loc-x3-y4)
   deleted: (at-robot loc-x3-y3)
   added: (at-robot loc-x3-y4)
   goals met: 14 of 25
47. (move loc-x3-y4 loc-x4-y4)
   deleted: (at-robot loc-x3-y4)
   added: (at-robot loc-x4-y4)
   goals met: 14 of 25
48. (visit loc-x4-y4)
   added: (visited loc-x4-y4)
   goals met: 15 of 25
49. (move loc-x4-y4 loc-x3-y4)
   deleted: (at-robot loc-x4-y4)
   added: (at-robot loc-x3-y4)
   goals met: 15 of 25
50. (move loc-x3-y4 loc-x3-y3)
   deleted: (at-robot loc-x3-y4)
   added: (at-robot loc-x3-y3)
   goals met: 15 of 25
51. (visit loc-x3-y3)
   added: (visited loc-x3-y3)
   goals met: 16 of 25
52. (move loc-x3-y3 loc-x4-y3)
   deleted: (at-robot loc-x3-y3)
   added: (at-robot loc-x4-y3)
   goals met: 16 of 25
53. (move loc-x4-y3 loc-x4-y2)
   deleted: (at-robot loc-x4-y3)
   added: (at-robot loc-x4-y2)
   goals met: 16 of 25
54. (visit loc-x4-y2)
   added: (visited loc-x4-y2)
   goals met: 17 of 25
55. (move loc-x4-y2 loc-x4-y3)
   deleted: (at-robot loc-x4-y2)
   added: (at-robot loc-x4-y3)
   goals met: 17 of 25
56. (move loc-x4-y3 loc-x3-y3)
   deleted: (at-robot loc-x4-y3)
   added: (at-robot loc-x3-y3)
   goals met: 17 of 25
57. (move loc-x3-y3 loc-x3-y4)
   deleted: (at-robot loc-x3-y3)
   added: (at-robot loc-x3-y4)
   goals met: 17 of 25
58. (move loc-x3-y4 loc-x2-y4)
   deleted: (at-robot loc-x3-y4)
   added: (at-robot loc-x2-y4)
   goals met: 17 of 25
59. (visit loc-x2-y4)
   added: (visited loc-x2-y4)
   goals met: 18 of 25
60. (move loc-x2-y4 loc-x1-y4)
   deleted: (at-robot loc-x2-y4)
   added: (at-robot loc-x1-y4)
   goals met: 18 of 25
61. (move loc-x1-y4 loc-x1-y3)
   deleted: (at-robot loc-x1-y4)
   added: (at-robot loc-x1-y3)
   goals met: 18 of 25
62. (move loc-x1-y3 loc-x1-y2)
   deleted: (at-robot loc-x1-y3)
   added: (at-robot loc-x1-y2)
   goals met: 18 of 25
63. (move loc-x1-y2 loc-x0-y2)
   deleted: (at-robot loc-x1-y2)
   added: (at-robot loc-x0-y2)
   goals met: 18 of 25
64. (visit loc-x0-y2)
   added: (visited loc-x0-y2)
   goals met: 19 of 25
65. (move loc-x0-y2 loc-x1-y2)
   deleted: (at-robot loc-x0-y2)
   added: (at-robot loc-x1-y2)
   goals met: 19 of 25
66. (move loc-x1-y2 loc-x1-y3)
   deleted: (at-robot loc-x1-y2)
   added: (at-robot loc-x1-y3)
   goals met: 19 of 25
67. (visit loc-x1-y3)
   added: (visited loc-x1-y3)
   goals met: 20 of 25
68. (move loc-x1-y3 loc-x1-y2)
   deleted: (at-robot loc-x1-y3)
   added: (at-robot loc-x1-y2)
   goals met: 20 of 25
69. (move loc-x1-y2 loc-x2-y2)
   deleted: (at-robot loc-x1-y2)
   added: (at-robot loc-x2-y2)
   goals met: 20 of 25
70. (move loc-x2-y2 loc-x2-y1)
   deleted: (at-robot loc-x2-y2)
   added: (at-robot loc-x2-y1)
   goals met: 20 of 25
71. (move loc-x2-y1 loc-x3-y1)
   deleted: (at-robot loc-x2-y1)
   added: (at-robot loc-x3-y1)
   goals met: 20 of 25
72. (move loc-x3-y1 loc-x3-y0)
   deleted: (at-robot loc-x3-y1)
   added: (at-robot loc-x3-y0)
   goals met: 20 of 25
73. (move loc-x3-y0 loc-x4-y0)
   deleted: (at-robot loc-x3-y0)
   added: (at-robot loc-x4-y0)
   goals met: 20 of 25
74. (visit loc-x4-y0)
   added: (visited loc-x4-y0)
   goals met: 21 of 25
75. (move loc-x4-y0 loc-x3-y0)
   deleted: (at-robot loc-x4-y0)
   added: (at-robot loc-x3-y0)
   goals met: 21 of 25
76. (visit loc-x3-y0)
   added: (visited loc-x3-y0)
   goals met: 22 of 25
77. (move loc-x3-y0 loc-x3-y1)
   deleted: (at-robot loc-x3-y0)
   added: (at-robot loc-x3-y1)
   goals met: 22 of 25
78. (move loc-x3-y1 loc-x3-y2)
   deleted: (at-robot loc-x3-y1)
   added: (at-robot loc-x3-y2)
   goals met: 22 of 25
79. (move loc-x3-y2 loc-x2-y2)
   deleted: (at-robot loc-x3-y2)
   added: (at-robot loc-x2-y2)
   goals met: 22 of 25
80. (move loc-x2-y2 loc-x2-y3)
   deleted: (at-robot loc-x2-y2)
   added: (at-robot loc-x2-y3)
   goals met: 22 of 25
81. (move loc-x2-y3 loc-x1-y3)
   deleted: (at-robot loc-x2-y3)
   added: (at-robot loc-x1-y3)
   goals met: 22 of 25
82. (move loc-x1-y3 loc-x1-y4)
   deleted: (at-robot loc-x1-y3)
   added: (at-robot loc-x1-y4)
   goals met: 22 of 25
83. (visit loc-x1-y4)
   added: (visited loc-x1-y4)
   goals met: 23 of 25
84. (move loc-x1-y4 loc-x0-y4)
   deleted: (at-robot loc-x1-y4)
   added: (at-robot loc-x0-y4)
   goals met: 23 of 25
85. (visit loc-x0-y4)
   added: (visited loc-x0-y4)
   goals met: 24 of 25
86. (move loc-x0-y4 loc-x1-y4)
   deleted: (at-robot loc-x0-y4)
   added: (at-robot loc-x1-y4)
   goals met: 24 of 25
87. (move loc-x1-y4 loc-x2-y4)
   deleted: (at-robot loc-x1-y4)
   added: (at-robot loc-x2-y4)
   goals met: 24 of 25
88. (move loc-x2-y4 loc-x2-y3)
   deleted: (at-robot loc-x2-y4)
   added: (at-robot loc-x2-y3)
   goals met: 24 of 25
89. (move loc-x2-y3 loc-x3-y3)
   deleted: (at-robot loc-x2-y3)
   added: (at-robot loc-x3-y3)
   goals met: 24 of 25
90. (move loc-x3-y3 loc-x3-y2)
   deleted: (at-robot loc-x3-y3)
   added: (at-robot loc-x3-y2)
   goals met: 24 of 25
91. (move loc-x3-y2 loc-x4-y2)
   deleted: (at-robot loc-x3-y2)
   added: (at-robot loc-x4-y2)
   goals met: 24 of 25
92. (move loc-x4-y2 loc-x4-y1)
   deleted: (at-robot loc-x4-y2)
   added: (at-robot loc-x4-y1)
   goals met: 24 of 25
93. (visit loc-x4-y1)
   added: (visited loc-x4-y1)
   goals met: 25 of 25
